README.org
***** HWB Extractor

The value extractor for HWB is identical to the one for HSL.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/hwb.js" :comments link
/** Extract: HWB values */
export const extract = (hwb) => hwb.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
#+END_SRC

Finally, the tests for value extraction.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const hwb = await import(`${Deno.cwd()}/src/internals/color/format/hwb.js`);

<<valid-hwb>>

console.log("const colors =", colors.map(({ color }) => ({ color, values: hwb.extract(color) })));
#+END_SRC

#+NAME: extracted-hwb
#+begin_src deno
const colors = [
  { color: "hwb(0 100% 0%)", values: [ "0", "100%", "0%" ] },
  { color: "hwb(0 0% 100%)", values: [ "0", "0%", "100%" ] },
  { color: "hwb(0 100% 100%)", values: [ "0", "100%", "100%" ] },
  { color: "hwb(47 37% 40%)", values: [ "47", "37%", "40%" ] },
  { color: "hwb(180deg 50% 3%)", values: [ "180deg", "50%", "3%" ] },
  { color: "hwb(172rad 25% 15%)", values: [ "172rad", "25%", "15%" ] },
  { color: "hwb(3.1grad 0% 30%)", values: [ "3.1grad", "0%", "30%" ] },
  { color: "hwb(0.28turn 49% 10%)", values: [ "0.28turn", "49%", "10%" ] },
  { color: "hwb(310 78% 0% / 0.5)", values: [ "310", "78%", "0%", "0.5" ] },
  { color: "hwb(89rad 10% 90% / 83%)", values: [ "89rad", "10%", "90%", "83%" ] }
]
#+end_src

**** Functional CIELAB (=src/internals/color/format/lab.js=)

The CSS Color Module Level 4 is currently drafting [[https://www.w3.org/TR/css-color-4/#lab-colors][support for device-independent color
formats]]. Quarks System Core supports both.

First up is the CIELAB (often called Lab for short) color format. The format specification is better
explained on the linked W3C page above, but I'll summarize the components:

+ Lightness (L): a percentage value which, unlike HSL, is /not/ capped at =100%= for this space
+ hues (*a): magenta-red when positive, its complement when negative
+ hues (*b): yellow when positive, its complement when negative

The hue axes are unbound, but in everyday use typically cap at =±160=.

#+NAME: lab-formats
| Format          | Examples                      |
|-----------------+-------------------------------|
| =lab(L% a b)=     | =lab(0% 0 0)=                   |
| =lab(L% a b / A)= | =lab(50% 0 0)=                  |
|                 | =lab(100% 0 0)=                 |
|                 | =lab(49% 160 0)=                |
|                 | =lab(72% 0 160)=                |
|                 | =lab(19% 160 0)=                |
|                 | =lab(64% -160 0)=               |
|                 | =lab(46% 0 -160)=               |
|                 | =lab(34.3391% 49.3819 -4.3942)= |
|                 | =lab(57.38% 38.339 19.331)=     |
|                 | =lab(68.3194% -94 0)=           |
|                 | =lab(24.193% -66 138 / 0.9)=    |
|                 | =lab(88.1199% 78 -33 / 78%)=  |

***** CIELAB Validator

The Lab validator is not complex. It reuses the alpha validation expression and modifies the RGB
channel validation expression slightly.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/lab.js" :comments link
/** Validate: functional CIELAB format */
export function validate(color) {
  // CIELAB regexp

  // prefix: "lab("
  // L: float<0->%
  const L = /(?:(?:\d\.?\d?){1,}%)/;
  // a && b: -?int<0-160>
  let a, b;
  a = b = /(?:-?(?:160|(?:1[0-5][0-9]|(?:\d.?\d?){1,})))/;
  // transparency: float<0-1> || float<0-100>%
  const alpha = /(?:(?:0|0\.\d+|1)|(?:100|(?:\d\.?\d?){1,}%))/;
  // separators: " " || " /"
  const valueSep = /(?:[\s]+)/;
  const alphaSep = /(?:[\s/]+)/;
  // suffix: ")"

  return new RegExp(
    [
      "(?:^lab\\(",
      L.source,
      valueSep.source,
      a.source,
      valueSep.source,
      b.source,
      "(?:",
      alphaSep.source,
      alpha.source,
      ")?\\))$",
    ].join(""),
  ).test(color);
}
#+END_SRC

Now, it's validator testing time.

#+BEGIN_SRC deno :results output code replace :allow read :var labTable=lab-formats
const lab = await import(`${Deno.cwd()}/src/internals/color/format/lab.js`);
const [, ...colors] = labTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.map((color) => ({color, isCIELAB: lab.validate(color)})))
#+END_SRC

#+NAME: valid-lab
#+begin_src deno
const colors = [
  { color: "lab(50% 0 0)", isCIELAB: true },
  { color: "lab(100% 0 0)", isCIELAB: true },
  { color: "lab(49% 160 0)", isCIELAB: true },
  { color: "lab(72% 0 160)", isCIELAB: true },
  { color: "lab(19% 160 0)", isCIELAB: true },
  { color: "lab(64% -160 0)", isCIELAB: true },
  { color: "lab(46% 0 -160)", isCIELAB: true },
  { color: "lab(34.3391% 49.3819 -4.3942)", isCIELAB: true },
  { color: "lab(57.38% 38.339 19.331)", isCIELAB: true },
  { color: "lab(68.3194% -94 0)", isCIELAB: true },
  { color: "lab(24.193% -66 138 / 0.9)", isCIELAB: true },
  { color: "lab(88.1199% 78 -33 / 78%)", isCIELAB: true }
]
#+end_src

Good to go.

***** CIELAB Extractor

The CIELAB value extractor is a slight modification from the HSL extractor. The CIELAB extractor
needs to be able to capture negative and positive values as well as percentages.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/lab.js" :comments link
/** Extract: CIELAB values */
export const extract = (lab) => lab.match(/(-?[\d.]%?)+/g);
#+END_SRC

Time to test it.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const lab = await import(`${Deno.cwd()}/src/internals/color/format/lab.js`);

<<valid-lab>>

console.log("const colors =", colors.map(({ color }) => ({ color, values: lab.extract(color) })));
#+END_SRC

#+NAME: extracted-lab
#+begin_src deno
const colors = [
  { color: "lab(50% 0 0)", values: [ "50%", "0", "0" ] },
  { color: "lab(100% 0 0)", values: [ "100%", "0", "0" ] },
  { color: "lab(49% 160 0)", values: [ "49%", "160", "0" ] },
  { color: "lab(72% 0 160)", values: [ "72%", "0", "160" ] },
  { color: "lab(19% 160 0)", values: [ "19%", "160", "0" ] },
  { color: "lab(64% -160 0)", values: [ "64%", "-160", "0" ] },
  { color: "lab(46% 0 -160)", values: [ "46%", "0", "-160" ] },
  {
    color: "lab(34.3391% 49.3819 -4.3942)",
    values: [ "34.3391%", "49.3819", "-4.3942" ]
  },
  { color: "lab(57.38% 38.339 19.331)", values: [ "57.38%", "38.339", "19.331" ] },
  { color: "lab(68.3194% -94 0)", values: [ "68.3194%", "-94", "0" ] },
  { color: "lab(24.193% -66 138 / 0.9)", values: [ "24.193%", "-66", "138", "0.9" ] },
  { color: "lab(88.1199% 78 -33 / 78%)", values: [ "88.1199%", "78", "-33", "78%" ] }
]
#+end_src

**** Functional LCH (=src/internals/color/format/lch.js=)

The LCH color space is another device-independent color format with added support in the CSS Color
Module Level 4 spec. It's an offshoot of CIELAB designed to be a little more useful for people. It
consists of:

+ Lightness (L): a percentage value interpreted identically to CIELAB lightness
+ Chroma (C): a value corresponding to the amount of color desired
+ Hue (H): interpreted similar to HSL, but the angles map to the *a/*b axes

The chroma is theoretically boundless, but in everyday use caps at =230=. The hues at =0deg= and =180deg=
map to magenta-red and green-cyan, respectively. The hues at =90deg= and =270deg= map to a mustard
yellow and sky blue, respectively.

#+NAME: lch-formats
| Format          | Examples                              |
|-----------------+---------------------------------------|
| =lch(L% C H)=     | =lch(0% 0 0)=                           |
| =lch(L% C H / A)= | =lch(50% 0 0)=                          |
|                 | =lch(100% 0 0)=                         |
|                 | =lch(50% 230 0)=                        |
|                 | =lch(29.2345% 44.2 27)=                 |
|                 | =lch(52.2345% 72.2 56.2)=               |
|                 | =lch(60.3119% 34.3 139.3)=              |
|                 | =lch(39.119% 58.1 258.9)=               |
|                 | =lch(79.44% 119 320.89 / 0.7)=          |
|                 | =lch(62.1183% 42.5 81.881 / 89%)=       |
|                 | =lch(119.339% 39.9 130deg)=             |
|                 | =lch(93.411% 74.42 200rad)=             |
|                 | =lch(33% 38.4434 3grad)=                |
|                 | =lch(71.831% 204.314 0.184turn / 0.98)= |

***** LCH Validator

As a refinement of CIELAB, the LCH validator is a slightly modified implementation. It reuses the
CIELAB lightness expression but also pulls in the HSL hue expression. They accept the same input
even if they don't function the same way.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/lch.js" :comments link
/** Validate: functional LCH format */
export function validate(color) {
  // LCH regexp

  // prefix: "lch("
  // lightness: float<0->%
  const lightness = /(?:(?:\d\.?\d?){1,}%)/;
  // chroma: int<0-230>
  const chroma = /(?:(?:230|(?:2[0-2][0-9]|1[0-9][0-9])|(?:\d.?\d?){1,}))/;
  // hue: -?float<0->deg? || -?float<0->rad || -?float<0->grad || -?float<0->turn
  const hue = /(?:-?(?:(?:\d\.?\d?)(?:deg|g?rad|turn)?)+)/;
  // transparency: float<0-1> || float<0-100>%
  const alpha = /(?:(?:0|0\.\d+|1)|(?:100|(?:\d\.?\d?){1,}%))/;
  // separators: " " || " /"
  const valueSep = /(?:[\s]+)/;
  const alphaSep = /(?:[\s/]+)/;
  // suffix: ")"

  return new RegExp(
    [
      "(?:^lch\\(",
      lightness.source,
      valueSep.source,
      chroma.source,
      valueSep.source,
      hue.source,
      "(?:",
      alphaSep.source,
      alpha.source,
      ")?\\))$",
    ].join(""),
  ).test(color);
}
#+END_SRC

And it's format validation test time.

#+BEGIN_SRC deno :results output code replace :allow read :var lchTable=lch-formats
const lch = await import(`${Deno.cwd()}/src/internals/color/format/lch.js`);
const colors = lchTable.map(([a, b]) => b.replace(/=/g, ""));

console.log("const colors =", colors.map((color) => ({color, isLCH: lch.validate(color)})))
#+END_SRC

#+NAME: valid-lch
#+begin_src deno
const colors = [
  { color: "lch(0% 0 0)", isLCH: true },
  { color: "lch(50% 0 0)", isLCH: true },
  { color: "lch(100% 0 0)", isLCH: true },
  { color: "lch(50% 230 0)", isLCH: true },
  { color: "lch(29.2345% 44.2 27)", isLCH: true },
  { color: "lch(52.2345% 72.2 56.2)", isLCH: true },
  { color: "lch(60.3119% 34.3 139.3)", isLCH: true },
  { color: "lch(39.119% 58.1 258.9)", isLCH: true },
  { color: "lch(79.44% 119 320.89 / 0.7)", isLCH: true },
  { color: "lch(62.1183% 42.5 81.881 / 89%)", isLCH: true },
  { color: "lch(119.339% 39.9 130deg)", isLCH: true },
  { color: "lch(93.411% 74.42 200rad)", isLCH: true },
  { color: "lch(33% 38.4434 3grad)", isLCH: true },
  { color: "lch(71.831% 204.314 0.184turn / 0.98)", isLCH: true }
]
#+end_src

***** LCH Extractor

The LCH extractor is identical to the HSL extractor.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/lch.js" :comments link
/** Extract: LCH values */
export const extract = (lch) => lch.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
#+END_SRC

Now, I'll set up some extraction tests.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const lch = await import(`${Deno.cwd()}/src/internals/color/format/lch.js`);

<<valid-lch>>

console.log("const colors =", colors.map(({ color }) => ({ color, values: lch.extract(color) })));
#+END_SRC

#+NAME: extracted-lch
#+begin_src deno
const colors = [
  { color: "lch(0% 0 0)", values: [ "0%", "0", "0" ] },
  { color: "lch(50% 0 0)", values: [ "50%", "0", "0" ] },
  { color: "lch(100% 0 0)", values: [ "100%", "0", "0" ] },
  { color: "lch(50% 230 0)", values: [ "50%", "230", "0" ] },
  { color: "lch(29.2345% 44.2 27)", values: [ "29.2345%", "44.2", "27" ] },
  { color: "lch(52.2345% 72.2 56.2)", values: [ "52.2345%", "72.2", "56.2" ] },
  { color: "lch(60.3119% 34.3 139.3)", values: [ "60.3119%", "34.3", "139.3" ] },
  { color: "lch(39.119% 58.1 258.9)", values: [ "39.119%", "58.1", "258.9" ] },
  {
    color: "lch(79.44% 119 320.89 / 0.7)",
    values: [ "79.44%", "119", "320.89", "0.7" ]
  },
  {
    color: "lch(62.1183% 42.5 81.881 / 89%)",
    values: [ "62.1183%", "42.5", "81.881", "89%" ]
  },
  { color: "lch(119.339% 39.9 130deg)", values: [ "119.339%", "39.9", "130deg" ] },
  { color: "lch(93.411% 74.42 200rad)", values: [ "93.411%", "74.42", "200rad" ] },
  { color: "lch(33% 38.4434 3grad)", values: [ "33%", "38.4434", "3grad" ] },
  {
    color: "lch(71.831% 204.314 0.184turn / 0.98)",
    values: [ "71.831%", "204.314", "0.184turn", "0.98" ]
  }
]
#+end_src

And that's it. Full support for validating and extracting the values of all current (and future) CSS
color formats. Not very useful  by itself, so I'm going to write functionality to convert between them.

*** Conversion

* Data

This section documents lookup tables and other hardcoded bits of data used by the core modules.

** Color

